Revit 2024 API
DimensionSegment.Value Property
 The length of the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Nullable<double> Value { get; }
Visual Basic
Public ReadOnly Property Value As Nullable(Of Double)
	Get
Visual C++
public:
property Nullable<double> Value {
	Nullable<double> get ();
}
See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace